Emacs.org
#+TITLE:  Configuração do Emacs
#+AUTHOR: João Lucas Farias
#+EMAIL: fariasjota09@gmail.com
#+OPTIONS: ':t toc:t author:t email:t
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Introdução
Esse é o arquivo com as configurações de inicialização do Emacs, escrito em Org com os blocos de código em emacs-lisp. Os blocos de código desse arquivo são exportados para o arquivo init.el. Os pacotes vem com hyperlink para facilitar o acesso às suas páginas e as configurações vem com explicações de como e porque foram implementadas.

* Inicialização
Coloca como buffer de inicialização a org-agenda na visão dashboard (customizada). Além disso, coloca como diretório padrão de início o diretório "~/.emacs.d/", determina o tamanho da janela inicial e informa os dados do usuário.

#+begin_src emacs-lisp
  
  ;; Buffer de inicialização
  (add-hook 'after-init-hook (lambda () (org-agenda nil "d") (delete-other-windows)))
  
  ;; Diretório de inicialização
  (setq default-directory "~/.emacs.d/")
  
  ;; Tamanho da janela de inicialização
  (add-to-list 'initial-frame-alist '(height . 1.0))
  (add-to-list 'initial-frame-alist '(width . 1.0))
  
  ;; Dados de usuário
  (setq user-full-name "João Lucas Correia Barbosa de Farias")
  (setq user-mail-address "fariasjota09@gmail.com")
  (defvar user-url "https://github.com/jotafarias13")
  
#+end_src

* Interface de Usuário (UI)
Retira alguns elementos desnecessário do Emacs GUI e coloca elementos importantes de visualização de texto. O pacote /[[https://github.com/seagle0128/doom-modeline][doom-modeline]]/ habilita um design minimalista para a barra de modos do Emacs. O pacote /[[https://github.com/domtronn/all-the-icons.el][All The Icons]]/ habilita ícones para todos os tipos de arquivos e diretórios para melhor visualização. O comando para instalar as fontes (/all-the-icons-install-fonts/) adiciona cores para os ícones e só precisa ser executado uma vez. 

#+begin_src emacs-lisp
  
  ;; Remove de mensagem de boas-vindas
  (setq inhibit-startup-message t)
  
  ;; Remove menus
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  
  ;; Remove barra de rolagem
  (scroll-bar-mode -1)
  
  ;; Numerar linhas e colunas
  (column-number-mode)
  (global-display-line-numbers-mode t)
  
  ;; Desabilita line-number para alguns modos
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  pdf-view-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  
  ;; Configura a numeração das linhas para serem relativas a linha atual
  (add-hook 'display-line-numbers-mode-hook
            '(lambda () (setq display-line-numbers 'relative)))
  
  
  ;; Visual line mode sempre ativo
  (global-visual-line-mode 1)
  
  ;; Indica começo-fim de parênteses
  (add-hook 'after-init-hook (lambda () (show-paren-mode 1)))
  ;; Altera cor do parêntese e do background quando der match em um parêntese
  (add-hook 'show-paren-mode-hook '(lambda () (set-face-attribute 'show-paren-match nil :foreground "Magenta" :background "#595959")))
  ;; Obs: foi necessário fazer dessa forma por que o show-paren-mode-hook não estava funcionando como esperado.
  
  ;; Barra de modos (inferior) minimalista
  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
  
  ;; Pacote All the icons
  (use-package all-the-icons)
  ;; Obs: é preciso instalar as fontes do pacote (executar apenas uma vez)
  ;; M-x all-the-icons-install-fonts
  
#+end_src

* Arquivos de Backup, Autosave e Custom
Gerencia os arquivos de backup e autosave para que fiquem localizados em diretórios distintos, ambos no diretório "~/.emacs.d/". Além disso, envia os /custom-commands/ que o próprio Emacs coloca no init.el para um arquivo separado, localizado no diretório "~/.emacs.d/".

#+begin_src emacs-lisp

;; Gerenciamento de arquivos de backup e autosave
(setq backup-directory-alist '((".*" . "~/.emacs.d/backup/")))
(setq version-control t)
(setq delete-old-versions t)
(setq auto-save-list-file-prefix "~/.emacs.d/autosave/")
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/autosave/" t)))

;; Envia comandos custom para outro arquivo
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

#+end_src

* Gerenciador de Pacotes
Configura o pacote /[[https://github.com/jwiegley/use-package][use-package]]/ como gerenciador padrão de pacotes para melhor instalação e configuração.

#+begin_src emacs-lisp

;; Inicialização do gerenciador de pacotes padrão
(require 'package)

;; Repositórios 
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

;; Inicialização de pacotes
(package-initialize)

;; Instalação do use-package
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

;; Coloca ":ensure t" em todos os pacotes
(require 'use-package)
(setq use-package-always-ensure t)

#+end_src

* Atualização Automática de Pacotes
O pacote /[[https://github.com/rranelli/auto-package-update.el][auto-package-update]]/ gerencia a atualização automática de pacotes e configura a frequência em que devem ser atualizados.

#+begin_src emacs-lisp
  
  ;; Gerencia atualização automática dos pacotes
  ;; (use-package auto-package-update
  ;;   :custom
  ;;   (auto-package-update-interval 30)
  ;;   (auto-package-update-prompt-before-update t)
  ;;   (auto-package-update-hide-results t)
  ;;   :config
  ;;   (auto-package-update-maybe)
  ;;   (auto-package-update-at-time "10:00"))
  
#+end_src

* Keybindings
Configura alguns keybindings para facilitar a abertura de diretórios e arquivos muito utilizados entre outros.

#+begin_src emacs-lisp
  
  ;; Atalhos personalizados para manipular janelas, selecionar texto e usar colar do clipboard
  (global-set-key (kbd "M-<up>") 'enlarge-window) ;; aumentar a janela verticalmente com M-<up>
  (global-set-key (kbd "M-<down>") 'shrink-window) ;; diminuir a janela verticalmente com M-<down>
  (global-set-key (kbd "M-<right>") 'enlarge-window-horizontally) ;; aumentar a janela horizontalmente com M-<right>
  (global-set-key (kbd "M-<left>") 'shrink-window-horizontally) ;; diminuir a janela horizontalmente com M-<left>
  ;; (global-set-key (kbd "C-=") 'set-mark-command) ;; selecionar texto com C-=
  (global-set-key (kbd "C-M-y") 'clipboard-yank) ;; colar do clipboard
  
  ;; Atalhos para dired, para abrir o init.el e para abrir o eshell 
  (global-set-key (kbd "C-M-0") (lambda () (interactive) (find-file "~/.emacs.d/Emacs.org" nil)))
  (global-set-key (kbd "C-M-1") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/Academico/Pós-Graduação/UFRN/Mestrado/Dissertação/Defesa/")))
  (global-set-key (kbd "C-M-2") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/Academico/Projetos/C++/")))
  (global-set-key (kbd "C-M-3") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/Academico/Projetos/Org/")))
  (global-set-key (kbd "C-M-4") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/")))
  (global-set-key (kbd "C-M-s") (lambda () (interactive) (eshell nil)))
  
#+end_src

* Configurações Gerais
** Comados Control e Meta
Coloca o /mac-command-modifier/ como Control e o /mac-right-command-modifier/ como Meta.

#+begin_src emacs-lisp

(when (eq system-type 'darwin) ;; verifica se está no Mac
  (setq mac-command-modifier 'control)
  (setq mac-right-command-modifier 'meta))

#+end_src

