init.el
;; Buffer de inicialização
(add-hook 'after-init-hook (lambda () (org-agenda nil "d") (delete-other-windows)))

;; Diretório de inicialização
(setq default-directory "~/.emacs.d/")

;; Tamanho da janela de inicialização
(add-to-list 'initial-frame-alist '(height . 1.0))
(add-to-list 'initial-frame-alist '(width . 1.0))

;; Dados de usuário
(setq user-full-name "João Lucas Correia Barbosa de Farias")
(setq user-mail-address "fariasjota09@gmail.com")
(defvar user-url "https://github.com/jotafarias13")

;; Remove de mensagem de boas-vindas
(setq inhibit-startup-message t)

;; Remove menus
(tool-bar-mode -1)
(menu-bar-mode -1)

;; Remove barra de rolagem
(scroll-bar-mode -1)

;; Numerar linhas e colunas
(column-number-mode)
(global-display-line-numbers-mode t)

;; Desabilita line-number para alguns modos
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                pdf-view-mode-hook
                eshell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

;; Configura a numeração das linhas para serem relativas a linha atual
(add-hook 'display-line-numbers-mode-hook
          '(lambda () (setq display-line-numbers 'relative)))


;; Visual line mode sempre ativo
(global-visual-line-mode 1)

;; Indica começo-fim de parênteses
(add-hook 'after-init-hook (lambda () (show-paren-mode 1)))
;; Altera cor do parêntese e do background quando der match em um parêntese
(add-hook 'show-paren-mode-hook '(lambda () (set-face-attribute 'show-paren-match nil :foreground "Magenta" :background "#595959")))
;; Obs: foi necessário fazer dessa forma por que o show-paren-mode-hook não estava funcionando como esperado.

;; Barra de modos (inferior) minimalista
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

;; Pacote All the icons
(use-package all-the-icons)
;; Obs: é preciso instalar as fontes do pacote (executar apenas uma vez)
;; M-x all-the-icons-install-fonts

;; Gerenciamento de arquivos de backup e autosave
(setq backup-directory-alist '((".*" . "~/.emacs.d/backup/")))
(setq version-control t)
(setq delete-old-versions t)
(setq auto-save-list-file-prefix "~/.emacs.d/autosave/")
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/autosave/" t)))

;; Envia comandos custom para outro arquivo
(setq custom-file "~/.emacs.d/custom.el")
(load custom-file)

;; Inicialização do gerenciador de pacotes padrão
(require 'package)

;; Repositórios 
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

;; Inicialização de pacotes
(package-initialize)

;; Instalação do use-package
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

;; Coloca ":ensure t" em todos os pacotes
(require 'use-package)
(setq use-package-always-ensure t)

;; Gerencia atualização automática dos pacotes
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "10:00"))

;; Atalhos personalizados para manipular janelas, selecionar texto e usar colar do clipboard
(global-set-key (kbd "M-<up>") 'enlarge-window) ;; aumentar a janela verticalmente com M-<up>
(global-set-key (kbd "M-<down>") 'shrink-window) ;; diminuir a janela verticalmente com M-<down>
(global-set-key (kbd "M-<right>") 'enlarge-window-horizontally) ;; aumentar a janela horizontalmente com M-<right>
(global-set-key (kbd "M-<left>") 'shrink-window-horizontally) ;; diminuir a janela horizontalmente com M-<left>
(global-set-key (kbd "C-=") 'set-mark-command) ;; selecionar texto com C-=
(global-set-key (kbd "C-M-y") 'clipboard-yank) ;; colar do clipboard

;; Atalhos para dired, para abrir o init.el e para abrir o eshell 
(global-set-key (kbd "C-M-0") (lambda () (interactive) (find-file "~/.emacs.d/Emacs.org" nil)))
(global-set-key (kbd "C-M-1") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/Academico/Pós-Graduação/UFRN/Mestrado/Dissertação/Defesa/")))
(global-set-key (kbd "C-M-2") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/Academico/Projetos/C++/")))
(global-set-key (kbd "C-M-3") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/Academico/Projetos/Emacs/Org/")))
(global-set-key (kbd "C-M-4") (lambda () (interactive) (dired-jump nil "~/Sync/Jota/")))
(global-set-key (kbd "C-M-s") (lambda () (interactive) (eshell nil)))

(when (eq system-type 'darwin) ;; verifica se está no Mac
  (setq mac-command-modifier 'control)
  (setq mac-right-command-modifier 'meta))
