Emacs.org
** Fonte e Tema
Configura o tipo de tela, a fonte e seu tamanho, assim como o tema /[[https://github.com/hlissner/emacs-doom-themes][doom-moonlight]]/ utilizado no Emacs. 

#+begin_src emacs-lisp
  
  ;; Tamanho das fontes
  (defvar jlf/default-font-size 150)
  (defvar jlf/default-fixed-font-size 130)
  (defvar jlf/default-variable-font-size 150)
  (defvar jlf/monitor-font-size 190)
  (defvar jlf/monitor-fixed-font-size 170)
  (defvar jlf/monitor-variable-font-size 190)
  
  ;; Fontes utilizadas
  ;; É necessário baixar as fontes Fira Code e Inconsolata
  ;; As funções criadas com namespace 'sscreen' (switch-screen) possibilitam trocar os tamanhos das fontes para diferentes tipos de telas (sem alterar frame size ou modeline size)
  
  (defvar sscreen--current-screen-type-index 0
    "Index of the current screen type according to sscreen--screen-types.")
  
  (defvar sscreen-screen-types '("Default" "Monitor")
    "All screen types available for user setup.")
  
  (defun sscreen-switch-screen-type ()
    "Switches screen type changing font sizes accordingly."
    (interactive)
    (let* ((frame-inhibit-implied-resize t)
           (screen-type-list (append sscreen-screen-types '("Custom")))
           (screen-type (completing-read "Screen " screen-type-list)))
      (pcase screen-type
        ("Monitor" 
         (progn
           (set-face-attribute 'default nil :family "Inconsolata" :height jlf/monitor-font-size)
           (set-face-attribute 'fixed-pitch nil :family "Fira Code" :height jlf/monitor-fixed-font-size)
           (set-face-attribute 'variable-pitch nil :family "Inconsolata" :height jlf/monitor-variable-font-size :weight 'regular)))
        ("Custom" 
         (call-interactively
          (lambda (default-font-size fixed-font-size variable-font-size)
            (interactive "nDefault Font Size: \nnFixed Font Size: \nnVariable Font Size: ")
            (set-face-attribute 'default nil :family "Inconsolata" :height default-font-size)
            (set-face-attribute 'fixed-pitch nil :family "Fira Code" :height fixed-font-size)
            (set-face-attribute 'variable-pitch nil :family "Inconsolata" :height variable-font-size :weight 'regular))))
        (_ 
         (progn
           (set-face-attribute 'default nil :family "Inconsolata" :height jlf/default-font-size)
           (set-face-attribute 'fixed-pitch nil :family "Fira Code" :height jlf/default-fixed-font-size)
           (set-face-attribute 'variable-pitch nil :family "Inconsolata" :height jlf/default-variable-font-size :weight 'regular))))) 
    (doom-modeline-refresh-font-width-cache)) 
  
  (defun sscreen--change-screen-type (screen-type)
    "Updates font sizes according to screen-type."
    (let ((frame-inhibit-implied-resize t)) 
      (pcase screen-type
        ("Monitor" 
         (progn
           (set-face-attribute 'default nil :family "Inconsolata" :height jlf/monitor-font-size)
           (set-face-attribute 'fixed-pitch nil :family "Fira Code" :height jlf/monitor-fixed-font-size)
           (set-face-attribute 'variable-pitch nil :family "Inconsolata" :height jlf/monitor-variable-font-size :weight 'regular)))
        ("Custom" 
         (call-interactively
          (lambda (default-font-size fixed-font-size variable-font-size)
            (interactive "nDefault Font Size: \nnFixed Font Size: \nnVariable Font Size: ")
            (set-face-attribute 'default nil :family "Inconsolata" :height default-font-size)
            (set-face-attribute 'fixed-pitch nil :family "Fira Code" :height fixed-font-size)
            (set-face-attribute 'variable-pitch nil :family "Inconsolata" :height variable-font-size :weight 'regular))))
        (_ 
         (progn
           (set-face-attribute 'default nil :family "Inconsolata" :height jlf/default-font-size)
           (set-face-attribute 'fixed-pitch nil :family "Fira Code" :height jlf/default-fixed-font-size)
           (set-face-attribute 'variable-pitch nil :family "Inconsolata" :height jlf/default-variable-font-size :weight 'regular))))) 
    (doom-modeline-refresh-font-width-cache))
  
  (defun sscreen-toggle-screen-type ()
    "Updates the index of the current screen type to the next value in sscreen-screen-types and calls sscreen--change-screen-type to change the font sizes accordingly."
    (interactive)
    (setq sscreen--current-screen-type-index (+ sscreen--current-screen-type-index 1))
    (if (>= sscreen--current-screen-type-index (length sscreen-screen-types))
        (setq sscreen--current-screen-type-index 0))
    (let ((screen-type (nth sscreen--current-screen-type-index sscreen-screen-types)))
      (sscreen--change-screen-type screen-type)))
  
  ;; Inicializar o emacs com o screen type "Default"
  (add-hook 'after-init-hook (lambda () (sscreen--change-screen-type "Default")))
  
  ;; Keybinding para chamar a função
  (global-set-key (kbd "M-+") 'sscreen-toggle-screen-type)
  
  ;; Tema doom-moonlight
  (use-package doom-themes
    :init (load-theme 'doom-moonlight t))
  
#+end_src

** Whick-Key 
O pacote /[[https://github.com/justbur/emacs-which-key][which-key]]/ ajuda a descobrir o que cada keybinding faz oferecendo possibilidades de "completação" toda vez que o usuário começa a digitar um keybinding.

#+begin_src emacs-lisp

(use-package which-key
  :config
  (progn
    (which-key-setup-side-window-right-bottom)
    (which-key-mode)))

#+end_src

** Ace-Window 
O pacote /[[https://github.com/abo-abo/ace-window][ace-window]]/ gerencia a troca de janelas de maneira simples e rápida.

#+begin_src emacs-lisp

(use-package ace-window
  :bind (("C-1" . ace-window)))

#+end_src

** Ivy, Counsel e Swiper 
O pacote /[[https://github.com/abo-abo/swiper][ivy]]/ adiciona estrutura de autocompletion melhor para o Emacs e menus para abertura de arquivos, troca de buffer etc. O /[[https://github.com/Yevgnen/ivy-rich][ivy-rich]]/  adiciona uma coluna no minibuffer com descrições de cada comando, assim como keybindings existentes. O /[[https://github.com/seagle0128/all-the-icons-ivy-rich][all-the-icons-ivy-rich]]/ melhora a visualização do ivy, exibindo ícones para os buffers. O /[[https://github.com/abo-abo/swiper][counsel]]/ substitui alguns comandos do Emacs (como /find-file/, /switch-buffer/ etc) por comandos que funcionam bem com o /[[https://github.com/abo-abo/swiper][ivy]]/, facilitando a utilização dos comandos. O /[[https://github.com/abo-abo/swiper][swiper]]/ substitui o comando /isearch/  que melhora a ferramenta de pesquisa e tem integração com o /[[https://github.com/abo-abo/swiper][ivy]]/.

#+begin_src emacs-lisp
  
  ;; Configuração do ivy (autocompletar no minibuffer)
  (use-package ivy
    :diminish 
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)	
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           ("C-RET" . ivy-immediate-done)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))
  
  ;; Exibe ícones para todos os buffer no ivy
  (use-package all-the-icons-ivy-rich
    :after ivy
    :init (all-the-icons-ivy-rich-mode 1))
  
  ;; Adiciona informações sobre cada comando no ivy
  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))
  
  ;; Substitui comandos para funcionar melhor com ivy
  (use-package counsel
    :bind (:map counsel-mode-map
    ([remap switch-to-buffer] . counsel-switch-buffer)
    ([remap dired] . counsel-dired))
    :config
    (counsel-mode 1))
  
  ;; Ferramenta de pesquisa que substitui isearch e tem integração com ivy
  (use-package swiper)
  
#+end_src

