init.el

;; Autocompletion in-buffer
(use-package company
  :config
  (add-hook 'after-init-hook 'global-company-mode)
  (add-hook 'company-mode-hook '(lambda () (define-key company-active-map (kbd "<tab>") nil)))
  (add-hook 'company-mode-hook '(lambda () (define-key company-active-map (kbd "TAB") nil)))
  (add-hook 'company-mode-hook '(lambda () (define-key company-active-map (kbd "C-<return>") 'company-abort)))
  (add-hook 'company-mode-hook '(lambda () (define-key company-active-map (kbd "<return>") 'company-complete-selection)))
  (add-hook 'company-mode-hook '(lambda () (define-key company-active-map (kbd "C-j") 'company-select-next)))
  (add-hook 'company-mode-hook '(lambda () (define-key company-active-map (kbd "C-k") 'company-select-previous)))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.2))

;; Melhora aparência do menu de autocompletion
(use-package company-box
  :hook (company-mode . company-box-mode))

;; Configura a exibição de itens do dired, a funcionalidade do dwim e alocação de itens deletados
(use-package dired
  :ensure nil
  :bind (("C-x C-j" . dired-jump))
  :custom
  (dired-listing-switches "-agho --group-directories-first")

  (dired-dwim-target t) ;; quando tem dois dired abertos, usa o segundo como path pra comandos do primeiro
  (delete-by-moving-to-trash t)) ;; move os itens deletados para o lixo do computador

;; Configura a manutenção de um único buffer do dired quando se abre arquivos ou diretórios
(use-package dired-single
  :after evil-collection
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))  ;; utiliza 'h' e 'l' para subir/descer na raiz de diretórios

;; Configurações adicionais do dired-single (diretamente do repositório do pacote)
(defun my-dired-init ()
  "Remaps some dired functions to use dired-single functions.\nBunch of stuff to run for dired, either immediately or when it's
       loaded."
  (define-key dired-mode-map [remap dired-find-file]
    'dired-single-buffer)
  (define-key dired-mode-map [remap dired-mouse-find-file-other-window]
    'dired-single-buffer-mouse)
  (define-key dired-mode-map [remap dired-up-directory]
    'dired-single-up-directory))

;; if dired's already loaded, then the keymap will be bound
(if (boundp 'dired-mode-map)
    ;; we're good to go; just add our bindings
    (my-dired-init)
  ;; it's not loaded yet, so add our bindings to the load-hook
  (add-hook 'dired-load-hook 'my-dired-init))


;; Configura 'H' para esconder/exibir dotfiles nos itens do diretório
(use-package dired-hide-dotfiles
  :hook (dired-mode . dired-hide-dotfiles-mode)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "H" 'dired-hide-dotfiles-mode))

;; Configura o swiper para pesquisa no dired através do '/' 
(defun guto/dired-swiper ()
  "teste"
  (interactive)
  (swiper)
  (if (file-directory-p (dired-file-name-at-point))
      (progn
        (dired-single-buffer)
        (guto/dired-swiper))
    (dired-single-buffer)))

(with-eval-after-load "evil"
  (evil-define-key 'normal dired-mode-map (kbd "/") 'guto/dired-swiper)
  (evil-define-key 'normal dired-mode-map (kbd "SPC") 'dired-view-file))

;; ls do Mac não suporta a flag --dired
;; Instala o coreutils pelo homebrew
;; Coloca o path pro executável na variável 'insert-directory-program'
(when (string= system-type "darwin")
  (setq dired-use-ls-dired t
        insert-directory-program "/usr/local/bin/gls"))



;; Adiciona ícones para os elementos do dired
(use-package all-the-icons-dired
  :hook 
  (dired-mode . all-the-icons-dired-mode)
  (all-the-icons-dired-mode . (lambda () (setq all-the-icons-dired-monochrome nil))))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode)
  :config
  (set-face-attribute 'rainbow-delimiters-depth-3-face nil :foreground "systemBlueColor")) ;; Fica melhor com o tema doom-moonlight

;; Adiciona informação extra nos buffers de ajuda
(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

(defun jlf/olivetti-mode-setup ()
  (olivetti-mode)
  (olivetti-set-width 0.9))

(use-package olivetti
  :hook (org-mode . jlf/olivetti-mode-setup))
