Emacs.org
** Evil
O pacote /[[https://github.com/emacs-evil/evil][evil]]/ configura um major mode que simula o modo de edição do Vim, facilitando a edição de texto de forma geral. O pacote /[[https://github.com/apchamberlain/undo-tree.el][Undo Tree]]/ melhora as funções de desfazer e refazer (undo-redo) para o /[[https://github.com/emacs-evil/evil][evil]]/, tornando-as práticas e simples. O pacote /[[https://github.com/emacs-evil/evil-collection][evil-collection]]/ aumenta a integração do /[[https://github.com/emacs-evil/evil][evil]]/  com outros modos do Emacs. O pacote /[[https://github.com/emacs-evil/evil-surround][evil-surround]]/ emula a ação surround do vim, facilitando a edição de texto. O pacote /[[https://github.com/emacsorphanage/evil-textobj-line][evil-textobj-line]]/ adiciona "linha" (com o comando 'l') como um text-obj para edição de texto, assim como são "w,W,b,B" etc. O pacote /[[https://github.com/linktohack/evil-commentary][evil-commentary]]/ adiciona o comando "gc" para comentar como uma ação de edição de texto, assim como são "d,c,y" etc. O pacote /[[https://github.com/edkolev/evil-goggles][evil-goggles]]/ destaca (highlight) a parte do texto onde um comando foi efetuado, facilitando a percepção do que foi/será alterado. O pacote /[[https://github.com/Dewdrops/evil-exchange/tree/ac50f21b29b6e3a111e10a9e88ae61c907ac5ee8][evil-exchange]]/ adiciona a ação de "troca" de texto com o comando "gz", evitando o ato de copiar um texto, deletar outro e colar o primeiro. O pacote /[[https://github.com/PythonNut/evil-easymotion][evil-easymotion]]/ facilita a movimentação dentro do buffer, criando alvos nos resultados da pesquisa para que se consiga chegar a um local específico do buffer de forma mais rápida e natural.

#+begin_src emacs-lisp
  
  ;; Melhora as funções de desfazer e refazer do evil
  (use-package undo-tree
    :config
    (setq undo-tree-visualizer-diff t)
    (global-undo-tree-mode))
  
  ;; Configura o evil-mode para simular o Vim no Emacs
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-want-Y-yank-to-eol t)
    (setq evil-undo-system 'undo-tree)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-normal-state-map (kbd "m") (lambda () (interactive) (evil-open-below 1) (evil-normal-state)))
    (define-key evil-normal-state-map (kbd "M") (lambda () (interactive) (evil-open-above 1) (evil-normal-state)))
    (define-key evil-normal-state-map (kbd "g r") 'revert-buffer)
    (define-key evil-motion-state-map (kbd "C-u") 'evil-scroll-up)
    (define-key evil-insert-state-map (kbd "Z") (lambda () (interactive) (evil-force-normal-state) (evil-append-line 1)))
  
    ;; Configura a navegação para funcionar quando visual-line-mode não está ativado
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    (evil-global-set-key 'motion "gj" 'evil-next-line)
    (evil-global-set-key 'motion "gk" 'evil-previous-line)
  
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  
  ;; Aumenta a atuação dos keybindings do evil
  (use-package evil-collection
    :after evil
    :custom
    (evil-collection-company-use-tng nil)   ;; evita o bug de completion de funções do clangd
    :config
    (evil-collection-init))
  
  ;; Emula a ação surround do vim
  (use-package evil-surround
    :config
    (global-evil-surround-mode 1))
  
  ;; Adiciona "linha" como um text-obj (w,W,b,B etc)
  (use-package evil-textobj-line)
  
  ;; Adiciona o comandos "gc" para comentar como uma ação (d,c,y etc)
  (use-package evil-commentary
    :config
    (evil-commentary-mode))
  
  ;; Destaca a parte do texto onde um comando foi efetuado
  (use-package evil-goggles
    :config
    (evil-goggles-mode)
    (evil-goggles-use-diff-faces))
  
  (use-package evil-exchange)
  (setq evil-exchange-key (kbd "gz"))
  (setq evil-exchange-cancel-key (kbd "gZ"))
  (evil-exchange-install)
  
  (use-package evil-easymotion
    :config
    (evilem-default-keybindings "SPC"))
  
  (evilem-define (kbd "SPC f") (list 'evil-repeat-find-char
                                     'evil-repeat-find-char-reverse)
                 :pre-hook (save-excursion
                             (setq evil-this-type 'inclusive)
                             (call-interactively #'evil-find-char))
                 :bind ((evil-cross-lines t)))
  
  (evilem-define (kbd "SPC t") (list 'evil-repeat-find-char
                                     'evil-repeat-find-char-reverse)
                 :pre-hook (save-excursion
                             (setq evil-this-type 'inclusive)
                             (call-interactively #'evil-find-char-to))
                 :bind ((evil-cross-lines t)))
  
#+end_src

** Prescient
O pacote /[[https://github.com/raxod502/prescient.el][prescient]]/ possibilita uma forma mais inteligente de ordenar as opções de completion, tendo aplicações para ivy e company.

#+begin_src emacs-lisp
  
  (use-package prescient
    :custom
    (prescient-sort-full-matches-first t))
  
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-sort-commands '(:not swiper swiper-isearch ivy-switch-buffer ivy-completing-read))
    (ivy-prescient-retain-classic-highlighting t)
    :config (ivy-prescient-mode))
  
  (use-package company-prescient
    :custom
    (company-prescient-sort-length-enable nil)
    :config
    (company-prescient-mode))
  
#+end_src

** Diversos 
Configuração diversas que não entraram em outras categorias.

#+begin_src emacs-lisp

;; Altera o padrão para separação de sentenças para ser apenas um espaço
(setq sentence-end-double-space nil)

;; Diminui prompts yes/no para agilizar escolha
(fset 'yes-or-no-p 'y-or-n-p)

#+end_src

* Desenvolvimento
** YASnippet
O pacote /[[https://github.com/joaotavora/yasnippet][YASnippet]]/ possibilita a criação de bundles (como TextMate) para diversas linguagens de programação. O pacote /[[https://github.com/AndreaCrotti/yasnippet-snippets][yasnippet-snippets]]/ adiciona vários snippets úteis para utilização. Os snippets próprios criados pelo usuário estão no diretório "~/.emacs.d/snippets/" separados em diretórios distintos para cada linguaguem.

#+begin_src emacs-lisp

;; Possibilita a criação de bundles estilo TextMate
(use-package yasnippet
  :config (yas-global-mode 1))
 
;; Adiciona vários snippets úteis
(use-package yasnippet-snippets)

;; Diretório para adicionar snippets próprios
(setq yas-snippet-dirs '("~/.emacs.d/snippets"))

#+end_src

** Magit 
O pacote /[[https://github.com/magit/magit][Magit]]/ facilita a utilização de comandos em repositórios git, tornando-os naturais e fáceis de utilizar.

#+begin_src emacs-lisp

;; Interface Git
(use-package magit
  :custom 
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  (magit-diff-refine-hunk 'all)) 

#+end_src

*NOTA*
Para evitar escrever a senha do ssh à cada interação com o remote, foi feita a adição da chave para o ssh-agent por um tempo *limitado*. Para isso, foi necessário instalar o /[[https://github.com/funtoo/keychain][keychain]]/ no computador (não no Emacs) através do homebrew (talvez não precise mas não testei sem ele).

#+begin_src shell :tangle no

brew install keychain

#+end_src

Em seguida, para possibilitar que, sempre que eu der /pull/ ou /push/ para o remoto, o computador adicione a chave no ssh-agent, é preciso verificar se ela já existe ou não. Por isso, foram criados /global hooks/ para o git. É preciso configurar o arquivo global de configuração do git para determinar o diretório onde ele irá procurar pelos hooks globais.

#+begin_src shell :tangle no

git config --global core.hooksPath ~/.githooks/

#+end_src

Primeiramente, os /global hooks/ verificam se existe o arquivo GLOBAL_HOOKS no diretório .git do repositório local e se está escrito "no" dentro dele. Essa foi a forma temporária (feia e triste, diga-se de passagem) que eu encontrei para evitar que os /global hooks/ sejam executados em repositórios que eu não quero que eles sejam executados. Depois, eles verificam se a chave já está no ssh-agent e, se não estiver, a adicionam. Por fim, executam /local hooks/, se existirem. 

Para que a senha da chave pudesse ser digitada (dentro do Emacs) para adicioná-la ao ssh-agent foi preciso instalar o /[[https://github.com/theseal/ssh-askpass][ssh-askpass]]/ que abre uma janela do MacOS para digitar a senha. Sem isso, o Emacs não oferece maneira de digitar a senha e, portanto, não é possível adicionar a chave ao ssh-agent. A instalação foi feita através do homebrew.

#+begin_src shell :tangle no

brew tap theseal/ssh-askpass
brew install ssh-askpass

# Alternativamente, baixa os arquivos e move o binário para /usr/X11/bin/ (ou para o diretório que o seu computador requisitar)
sudo mv ssh-askpass /usr/X11R6/bin/

#+end_src

** Eshell 
O pacote /[[https://github.com/purcell/exec-path-from-shell][exec-path-from-shell]]/ configura o eshell do Emacs para utilizar o mesmo $PATH do terminal do computador.

#+begin_src emacs-lisp

;; Utiliza $PATH do terminal
(use-package exec-path-from-shell) ; torna o PATH do shell igual do temrinal
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))

#+end_src

