init.el

;; Melhora as funções de desfazer e refazer do evil
(use-package undo-tree
  :config
  (setq undo-tree-visualizer-diff t)
  (global-undo-tree-mode))

;; Configura o evil-mode para simular o Vim no Emacs
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-want-Y-yank-to-eol t)
  (setq evil-undo-system 'undo-tree)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-normal-state-map (kbd "m") (lambda () (interactive) (evil-open-below 1) (evil-normal-state)))
  (define-key evil-normal-state-map (kbd "M") (lambda () (interactive) (evil-open-above 1) (evil-normal-state)))
  (define-key evil-normal-state-map (kbd "g r") 'revert-buffer)
  (define-key evil-motion-state-map (kbd "C-u") 'evil-scroll-up)

  ;; Configura a navegação para funcionar quando visual-line-mode não está ativado
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-global-set-key 'motion "gj" 'evil-next-line)
  (evil-global-set-key 'motion "gk" 'evil-previous-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

;; Aumenta a atuação dos keybindings do evil
(use-package evil-collection
  :after evil
  :custom
  (evil-collection-company-use-tng nil)   ;; evita o bug de completion de funções do clangd
  :config
  (evil-collection-init))

;; Emula a ação surround do vim
(use-package evil-surround
  :config
  (global-evil-surround-mode 1))

;; Adiciona "linha" como um text-obj (w,W,b,B etc)
(use-package evil-textobj-line)

;; Adiciona o comandos "gc" para comentar como uma ação (d,c,y etc)
(use-package evil-commentary
  :config
  (evil-commentary-mode))

;; Destaca a parte do texto onde um comando foi efetuado
(use-package evil-goggles
  :config
  (evil-goggles-mode)
  (evil-goggles-use-diff-faces))

(use-package evil-exchange)
(setq evil-exchange-key (kbd "gz"))
(setq evil-exchange-cancel-key (kbd "gZ"))
(evil-exchange-install)

(use-package evil-easymotion
  :config
  (evilem-default-keybindings "SPC"))

(evilem-define (kbd "SPC f") (list 'evil-repeat-find-char
                                   'evil-repeat-find-char-reverse)
               :pre-hook (save-excursion
                           (setq evil-this-type 'inclusive)
                           (call-interactively #'evil-find-char))
               :bind ((evil-cross-lines t)))

(evilem-define (kbd "SPC t") (list 'evil-repeat-find-char
                                   'evil-repeat-find-char-reverse)
               :pre-hook (save-excursion
                           (setq evil-this-type 'inclusive)
                           (call-interactively #'evil-find-char-to))
               :bind ((evil-cross-lines t)))

(use-package prescient)

(use-package ivy-prescient
  :after counsel
  :config (ivy-prescient-mode))

(use-package company-prescient
  :custom
  (company-prescient-sort-length-enable nil)
  :config
  (company-prescient-mode))

;; Altera o padrão para separação de sentenças para ser apenas um espaço
(setq sentence-end-double-space nil)

;; Diminui prompts yes/no para agilizar escolha
(fset 'yes-or-no-p 'y-or-n-p)

;; Possibilita a criação de bundles estilo TextMate
(use-package yasnippet
  :config (yas-global-mode 1))
 
;; Adiciona vários snippets úteis
(use-package yasnippet-snippets)

;; Diretório para adicionar snippets próprios
(setq yas-snippet-dirs '("~/.emacs.d/snippets"))

;; Interface Git
(use-package magit
  :custom 
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
  (magit-diff-refine-hunk 'all))

;; Utiliza $PATH do terminal
(use-package exec-path-from-shell) ; torna o PATH do shell igual do temrinal
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))

;; AUCTeX
(use-package tex
  :ensure auctex)
