Emacs.org
** AUCTeX
O pacote /[[https://www.gnu.org/software/auctex/][AUCTeX]]/ auxilia e configura a escrita e formatação de arquivos TeX no Emacs. Algumas configurações foram adicionadas para possibilitar compilação com LaTeX-Mk e com watch-document e para colocar o Skim como visualizador de PDF padrão. O pacote /[[https://github.com/iyefrat/evil-tex][evil-tex]]/ habilita keybindings de evil voltados para escrita de documentos TeX.

#+begin_src emacs-lisp
  
  ;; AUCTeX
  (use-package tex
    :ensure auctex)
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq-default TeX-master nil)
  (add-hook 'LaTeX-mode-hook 'visual-line-mode)
  (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  (add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
  (setq reftex-plug-into-AUCTeX t)
  (setq TeX-PDF-mode t)
  
  ;; Ativa algumas configurações do AUCTeX para melhorar a escrita do código
  (setq TeX-electric-sub-and-superscript t)
  (setq LaTeX-electric-left-right-brace t)
  (setq TeX-electric-math (cons "$" "$"))
  
  ;; Coloca LaTeX-Mk disponível via C-c C-c
  ;; SyncTeX é configurado no arquivo "~/.latexmkrc"
  (eval-after-load "tex" (lambda ()
			   (push
			    '("LaTeX-Mk" "latexmk -pdf -pvc %s" TeX-run-TeX nil t
			      :help "Run LaTeX-Mk on file")
			    TeX-command-list)
			   (push
			    '("CleanAll" "latexmk -c" TeX-run-TeX nil t
			      :help "Files for deletion not found")
			    TeX-command-list)
			   (setq-default TeX-command-default "LaTeX-Mk")))
  
  ;; Usa Skim como visualizador padrão, habilita PDF Sync
  ;; Displayline do Skim é usado para pesquisa .tex -> .pdf
  ;; Opção -b grifa a lina atual e -g abre o Skim no background
  (setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
  (setq TeX-view-program-list
	'(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))
  
  ;; Inicializa o modo servidor no Emacs para possibilitar a comunicação com o Skim
  ;; (server-start)
  
  ;; Habilita evil keybindings voltados para TeX
  (use-package evil-tex
    :hook (LaTeX-mode . evil-tex-mode))
  (setq evil-tex-toggle-override-m nil)
  (setq evil-tex-toggle-override-t t)
  
  ;; Função personalizada para adicionar um novo item no itemize
  (defun jlf/LaTeX-insert-item ()
    (interactive)
    (evil-open-below 1)
    (insert "\\item ")
    (indent-for-tab-command)
    (evil-append 1))
  
  (add-hook 'LaTeX-mode-hook '(lambda () (define-key LaTeX-mode-map (kbd "C-<return>") 'jlf/LaTeX-insert-item)))
  
#+end_src

** LSP Mode 
O pacote /[[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]]/ serve como um cliente de Language Server Protocol para Emacs. Necessita de um servidor para fazer comunicação com o Emacs e simular ferramentas de uma IDE. Configurado para funcionar com o /[[https://clangd.llvm.org/][clangd]]/ para programação em C++. O pacote /[[https://github.com/emacs-lsp/lsp-ui][lsp-ui]]/ acrescenta informações sobre a parte do código sobre o qual o cursor está em cima, mostrando-as no minibuffer ou em um menu. O pacote /[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]]/ faz a integração do /[[https://github.com/abo-abo/swiper][ivy]]/ no /[[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]]/. Como o /[[https://emacs-lsp.github.io/lsp-mode/][lsp-mode]]/ é usado para programação em C/C++, a configuração do estilo de formatação do buffer é feita abaixo, modificando a variável /c-default-style/.

Após instalar o /[[https://clangd.llvm.org/][clangd]]/, é preciso adicionar ele ao $PATH do terminal. Depois, criar o arquivo compile_commands.json no project root directory. Para isso, instala o /[[https://github.com/nickdiego/compiledb][compiledb]]/ e o utiliza para gerar o .json através de um Makefile com o comando "compiledb -n make".

#+begin_src emacs-lisp

  ;; Instalação do clangd: brew install llvm
  ;; Instalação do compiledb: pip install compiledb

  ;; Breadcrumb no topo do buffer (caminho do arquivo)
  (defun jlf/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(project path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  ;; Adiciona funcionalidades de IDE para o Emacs
  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . jlf/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l") 
    (setq lsp-diagnostics-provider :none)
    :hook (c++-mode . lsp)
    :config
    (lsp-enable-which-key-integration t))

  ;; Feature do clangd que possibilita a escolha do overload de uma função no company-box
  (setq lsp-clients-clangd-args '("--completion-style=detailed" "--header-insertion=never"))

  ;; Pacote para adicionar explicação do código à medida que o cursor navega pelo buffer 
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

  ;; Realiza integração do ivy no lsp-mode
  (use-package lsp-ivy)

  ;; Configura o estilo de formatação de buffer para linguagens em C e similares
  ;; (setq c-default-style '(c++-mode  . “cc-mode”))
  (setq c-default-style
        '((java-mode . "java")
          (awk-mode . "awk")
          (c++-mode . "cc-mode")
          (other . "gnu")))

#+end_src

*** Python
O pacote python-mode configura programação em Python3 no Emacs. É preciso instalar algum lsp de python e colocá-lo no $PATH. Nesse caso, foi instalado o /[[https://github.com/python-lsp/python-lsp-server][pylsp]]/.

#+begin_src emacs-lisp
  
  ;; pip3 install 'python-lsp-server[all]'
  (use-package python-mode
    :ensure t
    :hook (python-mode . lsp-deferred)
    :custom
    ;; NOTE: Set these if Python 3 is called "python3" on your system!
    (python-shell-interpreter "python3"))

#+end_src

** Eglot
O pacote /[[https://github.com/joaotavora/eglot][Eglot]]/ serve como um cliente de Language Server Protocol para Emacs. Necessita de um servidor para fazer comunicação com o Emacs e simular ferramentas de uma IDE. Configurado para funcionar com o /[[https://github.com/astoff/digestif][Digestif]]/ para programação em LaTeX, se somando com as funcionalidades do /[[https://www.gnu.org/software/auctex/][AUCTeX]]/.  

Após baixar o /[[https://github.com/astoff/digestif][Digestif]]/, é preciso adicionar ele ao $PATH do terminal, torná-lo executável (chmod +x path-to-digestif) e executá-lo uma vez para que baixe o pacote.

#+begin_src emacs-lisp
  
  ;; Funciona como um cliente LSP para Emacs, utilizado para escrever em LaTeX
  (use-package eglot
    :hook (LaTeX-mode . eglot-ensure))
  
  ;; Auxilia o Eglot a reconhecer projetos com arquivos em diretórios distintos
  
  ;; (defvar main-tex "defesa.tex")
  (defvar main-tex "projeto-pesquisa.tex")
  
  (defun jlf/latex-root (dir)
    (when-let ((root (locate-dominating-file dir main-tex)))
      (cons 'latex-module root)))
  
  (add-hook 'project-find-functions #'jlf/latex-root)
  
  (cl-defmethod project-root ((project (head latex-module)))
     (cdr project))
  
#+end_src

** MyWorkSpace
A ferramenta /MyWorkSpace/ é uma função de minha autoria que me auxilia na abertura de arquivos e diretórios dos projetos nos quais trabalho. Ela foi criada por que os pacotes tradicionais e famosos que servem esse propósito são muito rebuscados e minha necessidade é suprida pelas poucas funcionalidades desta ferramenta.

#+begin_src emacs-lisp
  
  (defvar jlf/my-workspace-alist (list)
    "List of entries in workspace.")
  
  (add-to-list 'jlf/my-workspace-alist '("Artigo" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Artigos/2021/EJPC/"))) t)
  (add-to-list 'jlf/my-workspace-alist '("Dissertação C++" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Projetos/C++/pancreasArtificial/"))) t)
  (add-to-list 'jlf/my-workspace-alist '("Dissertação TeX" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Pós-Graduação/UFRN/Mestrado/Dissertação/Defesa/"))) t)
  (add-to-list 'jlf/my-workspace-alist '("Emacs" . (lambda () (jlf/my-workspace-find-file "~/.emacs.d/"))) t)
  (add-to-list 'jlf/my-workspace-alist '("Slip-Box" . (lambda () (jlf/my-workspace-find-file jlf/slipbox-directory))) t)
  (add-to-list 'jlf/my-workspace-alist '("Agenda" . (lambda () (org-agenda nil "d") (delete-other-windows))) t)
  (add-to-list 'jlf/my-workspace-alist '("Org" . (lambda () (jlf/my-workspace-find-file org-directory))) t)
  (add-to-list 'jlf/my-workspace-alist '("Doutorado" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Pós-Graduação/UFRN/Doutorado/"))) t)
  (add-to-list 'jlf/my-workspace-alist '("Ledger" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Financeiro/Ledger/"))) t)
  (add-to-list 'jlf/my-workspace-alist '("Lattes" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Projetos/Lattes/"))) t)
  
  (defun jlf/my-workspace-find-file (FILE)
    (let ((default-directory FILE))
      (call-interactively
       (lambda (file-name)
         (interactive "fOpen File: ")
         (find-file file-name nil)))))
  
  (defun jlf/my-workspace ()
    "Ferrameta para facilitar abertura de arquivos e diretórios dos projetos nos quais trabalho."
    (interactive)
    (let* ((my-workspace-list (mapcar 'car jlf/my-workspace-alist))
           (my-workspace (completing-read "WorkSpace: " (sort my-workspace-list (lambda (A B) (string-lessp A B))))))
      (if (assoc my-workspace jlf/my-workspace-alist)
          (funcall (cdr (assoc my-workspace jlf/my-workspace-alist)))
        (message "Invalid Argument!"))))
  
  (global-set-key (kbd "C-+") 'jlf/my-workspace) ;; Keybinding para ferramenta MyWorkSpace
  
#+end_src

