init.el
(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)
(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
(setq reftex-plug-into-AUCTeX t)
(setq TeX-PDF-mode t)

;; Ativa algumas configurações do AUCTeX para melhorar a escrita do código
(setq TeX-electric-sub-and-superscript t)
(setq LaTeX-electric-left-right-brace t)
(setq TeX-electric-math (cons "$" "$"))

;; Coloca LaTeX-Mk disponível via C-c C-c
;; SyncTeX é configurado no arquivo "~/.latexmkrc"
(eval-after-load "tex" (lambda ()
			 (push
			  '("LaTeX-Mk" "latexmk -pdf -pvc %s" TeX-run-TeX nil t
			    :help "Run LaTeX-Mk on file")
			  TeX-command-list)
			 (push
			  '("CleanAll" "latexmk -c" TeX-run-TeX nil t
			    :help "Files for deletion not found")
			  TeX-command-list)
			 (setq-default TeX-command-default "LaTeX-Mk")))

;; Usa Skim como visualizador padrão, habilita PDF Sync
;; Displayline do Skim é usado para pesquisa .tex -> .pdf
;; Opção -b grifa a lina atual e -g abre o Skim no background
(setq TeX-view-program-selection '((output-pdf "PDF Viewer")))
(setq TeX-view-program-list
      '(("PDF Viewer" "/Applications/Skim.app/Contents/SharedSupport/displayline -b -g %n %o %b")))

;; Inicializa o modo servidor no Emacs para possibilitar a comunicação com o Skim
;; (server-start)

;; Habilita evil keybindings voltados para TeX
(use-package evil-tex
  :hook (LaTeX-mode . evil-tex-mode))
(setq evil-tex-toggle-override-m nil)
(setq evil-tex-toggle-override-t t)

;; Função personalizada para adicionar um novo item no itemize
(defun jlf/LaTeX-insert-item ()
  (interactive)
  (evil-open-below 1)
  (insert "\\item ")
  (indent-for-tab-command)
  (evil-append 1))

(add-hook 'LaTeX-mode-hook '(lambda () (define-key LaTeX-mode-map (kbd "C-<return>") 'jlf/LaTeX-insert-item)))

;; Instalação do clangd: brew install llvm
;; Instalação do compiledb: pip install compiledb

;; Breadcrumb no topo do buffer (caminho do arquivo)
(defun jlf/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(project path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

;; Adiciona funcionalidades de IDE para o Emacs
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . jlf/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l") 
  (setq lsp-diagnostics-provider :none)
  :hook (c++-mode . lsp)
  :config
  (lsp-enable-which-key-integration t))

;; Feature do clangd que possibilita a escolha do overload de uma função no company-box
(setq lsp-clients-clangd-args '("--completion-style=detailed" "--header-insertion=never"))

;; Pacote para adicionar explicação do código à medida que o cursor navega pelo buffer 
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

;; Realiza integração do ivy no lsp-mode
(use-package lsp-ivy)

;; Configura o estilo de formatação de buffer para linguagens em C e similares
;; (setq c-default-style '(c++-mode  . “cc-mode”))
(setq c-default-style
      '((java-mode . "java")
        (awk-mode . "awk")
        (c++-mode . "cc-mode")
        (other . "gnu")))

;; Funciona como um cliente LSP para Emacs, utilizado para escrever em LaTeX
(use-package eglot
  :hook (LaTeX-mode . eglot-ensure))

;; Auxilia o Eglot a reconhecer projetos com arquivos em diretórios distintos

;; (defvar main-tex "defesa.tex")
(defvar main-tex "projeto-pesquisa.tex")

(defun jlf/latex-root (dir)
  (when-let ((root (locate-dominating-file dir main-tex)))
    (cons 'latex-module root)))

(add-hook 'project-find-functions #'jlf/latex-root)

(cl-defmethod project-root ((project (head latex-module)))
   (cdr project))

(defvar jlf/my-workspace-alist (list)
  "List of entries in workspace.")

(add-to-list 'jlf/my-workspace-alist '("Artigo" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Artigos/2021/EJPC/"))) t)
(add-to-list 'jlf/my-workspace-alist '("Dissertação C++" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Projetos/C++/pancreasArtificial/"))) t)
(add-to-list 'jlf/my-workspace-alist '("Dissertação TeX" . (lambda () (jlf/my-workspace-find-file "~/Sync/Jota/Academico/Pós-Graduação/UFRN/Mestrado/Dissertação/Defesa/"))) t)
(add-to-list 'jlf/my-workspace-alist '("Emacs" . (lambda () (jlf/my-workspace-find-file "~/.emacs.d/"))) t)
(add-to-list 'jlf/my-workspace-alist '("Slip-Box" . (lambda () (jlf/my-workspace-find-file jlf/slipbox-directory))) t)
(add-to-list 'jlf/my-workspace-alist '("Agenda" . (lambda () (org-agenda nil "d") (delete-other-windows))) t)
(add-to-list 'jlf/my-workspace-alist '("Org" . (lambda () (jlf/my-workspace-find-file org-directory))) t)

(defun jlf/my-workspace-find-file (FILE)
  (let ((default-directory FILE))
    (call-interactively
     (lambda (file-name)
       (interactive "fOpen File: ")
       (find-file file-name nil)))))

(defun jlf/my-workspace ()
  "Ferrameta para facilitar abertura de arquivos e diretórios dos projetos nos quais trabalho."
  (interactive)
  (let* ((my-workspace-list (mapcar 'car jlf/my-workspace-alist))
         (my-workspace (completing-read "WorkSpace: " my-workspace-list)))
    (if (assoc my-workspace jlf/my-workspace-alist)
        (funcall (cdr (assoc my-workspace jlf/my-workspace-alist)))
      (message "Invalid Argument!"))))

(global-set-key (kbd "C-+") 'jlf/my-workspace) ;; Keybinding para ferramenta MyWorkSpace
