init.el

;; Variável do diretório root dos arquivos do slip-box
  (defvar jlf/slipbox-directory "~/Sync/Jota/Academico/Projetos/Slip-Box/"
    "Directory of slip-box files.")
  
  ;; Variável do diretório dos arquivos de referência slip-box
  (defvar jlf/slipbox-refs-directory "~/Sync/Jota/Academico/Projetos/Slip-Box/Refs/"
    "Directory of slip-box ref files.")
  
  ;; Variável do diretório dos dailies do slip-box (fleeting notes do zettelkasten)
  (defvar jlf/slipbox-dailies-directory "~/Sync/Jota/Academico/Projetos/Slip-Box/Dailies/"
    "Directory of slip-box dailies files.")
  
  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)
    :custom
    (org-roam-directory (file-truename jlf/slipbox-directory))
    (org-roam-capture-templates
     '(("n" "Note File" plain "%?"
        :if-new (file+head "${slug}.org"
                           "#+TITLE: ${title}\n#+AUTHOR: %(print user-full-name)\n#+EMAIL: %(print user-mail-address)\n#+URL: %(print user-url)\n#+CREATED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+LAST_MODIFIED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+FILETAGS:\n\n* ")
        :unnarrowed t)))
    (org-roam-capture-ref-templates
     '(("r" "Roam Ref Protocol" plain "%?"
        :if-new (file+head "Refs/${slug}.org"
                           "#+TITLE: ${title}\n#+AUTHOR: %(print user-full-name)\n#+EMAIL: %(print user-mail-address)\n#+URL: %(print user-url)\n#+CREATED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+LAST_MODIFIED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+FILETAGS:\n\n* ")
        :unnarrowed t)))
    (org-roam-dailies-directory jlf/slipbox-dailies-directory)
    (org-roam-dailies-capture-templates
     '(("d" "Dailies" entry
        "* %?"
        :if-new (file+head "Dailies/%<%Y-%m-%d>.org"
                           "#+TITLE: %<%Y-%m-%d>\n\n"))))
    :bind (("C-c n l" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n g" . org-roam-graph)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n c" . org-roam-capture)
           ;; Dailies
           ("C-c n j" . org-roam-dailies-capture-today))
    :config
    (org-roam-setup))
  
  
  (with-eval-after-load "org-roam"
  
    (cl-defmethod org-roam-node-filetitle ((node org-roam-node))
      "Return the file TITLE for the node."
      (org-roam-get-keyword "TITLE" (org-roam-node-file node)))
  
    (cl-defmethod org-roam-node-filecitekey ((node org-roam-node))
      "Return the file CITE_KEY for the node."
      (org-roam-get-keyword "CITE_KEY" (org-roam-node-file node)))
  
    (cl-defmethod org-roam-node-directories ((node org-roam-node))
      (if-let ((dirs (file-name-directory (file-relative-name (org-roam-node-file node) org-roam-directory))))
          (format "(%s)" (string-join (f-split dirs) "/"))
        ""))
  
    (cl-defmethod org-roam-node-backlinkscount ((node org-roam-node))
      (let* ((count (caar (org-roam-db-query
                           [:select (funcall count source)
                                    :from links
                                    :where (= dest $s1)
                                    :and (= type "id")]
                           (org-roam-node-id node)))))
        (format "[%d]" count)))
  
    (cl-defmethod org-roam-node-hierarchy ((node org-roam-node))
      "Return the hierarchy for the node."
      (let ((title (org-roam-node-title node))
            (olp (org-roam-node-olp node))
            (level (org-roam-node-level node))
            (filetitle (org-roam-node-filetitle node))
            (filecitekey (org-roam-node-filecitekey node)))
        (if filecitekey
            (concat
             (if (> level 0) (concat filecitekey " > "))
             (if (> level 1) (concat (string-join olp " > ") " > "))
             (if (= level 0) filecitekey title))
          (concat
           (if (> level 0) (concat filetitle " > "))
           (if (> level 1) (concat (string-join olp " > ") " > "))
           title)))))
  
  (setq org-roam-node-display-template "${directories:10} ${hierarchy:*} ${tags:25} ${backlinkscount:6}")
  
  (defun jlf/org-roam-node-exclude-add ()
    "Add ROAM_EXCLUDE property to node with value t."
    (org-entry-put (point) "ROAM_EXCLUDE" "t"))
  
  (advice-add 'org-noter-insert-note :after 'jlf/org-roam-node-exclude-add)
  
  
  ;; Função para atualizar campos em um org buffer. Usada para atualizar o #+LAST_MODIFIED
  (defun jlf/org-update-field (REGEXP_FIELD NEW &optional ANYWHERE)
    "Update any field that starts at the beginning of a line in an org buffer. 
REGEXP_FIELD is a string with regexp match to the desired field. Beware that, as it is a string, any time you use the escape character (\\) you need to insert two of them for the match to occur. For example, if you want to match the field #+LAST_MODIFIED: you need to pass #\\\\+LAST_MODIFIED: as a string to REGEXP_FIELD. 
NEW is a string with the new value for the field. 
If ANYWHERE is t, the match can occur anywhere inside the buffer. If it is nil or ommited, the match can only occur before the first heading."
    (save-excursion
      (goto-char (point-min))
      (let ((first-heading
             (save-excursion
               (re-search-forward org-outline-regexp-bol nil t))))
        (if (re-search-forward (concat "^" REGEXP_FIELD) (if ANYWHERE nil first-heading) t)
            (progn
              (if (looking-at-p " ")
                  (forward-char)
                (insert " "))
              (delete-region (point) (line-end-position))
              (insert NEW))
          nil))))
  
  ;; Função para atualizar o campo #+LAST_MODIFIED em org buffers
  (defun jlf/org-update-last-modified ()
    "Update #+LAST_MODIFIED field in org buffers."
    (when (derived-mode-p 'org-mode)
      (jlf/org-update-field "#\\+LAST_MODIFIED:" (format-time-string "[%d-%m-%Y %a %H:%M:%S]") nil)))
  
  ;; Hook para atualizar 
  (add-hook 'before-save-hook 'jlf/org-update-last-modified)
  
  ;; org-roam-protocol
  (require 'org-roam-protocol)
  
  ;; org-roam-server
  ;; (use-package org-roam-server
  ;;   :config
  ;;   (setq org-roam-server-host "127.0.0.1"
  ;;         org-roam-server-port 8080
  ;;         org-roam-server-authenticate nil
  ;;         org-roam-server-export-inline-images t
  ;;         org-roam-server-serve-files nil
  ;;         org-roam-server-served-file-extensions '("pdf" "mp4" "ogv")
  ;;         org-roam-server-network-poll t
  ;;         org-roam-server-network-arrows nil
  ;;         org-roam-server-network-label-truncate t
  ;;         org-roam-server-network-label-truncate-length 60
  ;;         org-roam-server-network-label-wrap-length 20))

(use-package org-noter
  :custom
  (org-noter-notes-search-path (list jlf/slipbox-refs-directory))
  (org-noter-doc-split-fraction '(0.7 . 0.3))
  ;; (org-noter-insert-note-no-questions t)
  ;; (org-noter-hide-other nil)
  (org-noter-always-create-frame nil)
  (org-noter-kill-frame-at-session-end nil))

;; Função para ajeitar o bug do visual-line-mode no org-noter
(defun zp/org-noter-visual-line-mode ()
  "Enable visual-line-mode in ‘org-noter’ notes.
Workaround to counter race conditions with the margins."
  (let ((parent (current-buffer))
        (refresh (lambda (parent)
                   (with-current-buffer parent
                     (visual-line-mode 'toggle)
                     (visual-line-mode 'toggle)))))
    (run-at-time "1 sec" nil refresh parent)
    (run-at-time "5 sec" nil refresh parent)))

(add-hook 'org-noter-notes-mode-hook #'zp/org-noter-visual-line-mode)
