Emacs.org
*** org-pdftools
O pacote [[https://github.com/fuxialexander/org-pdftools][org-pdftools]] cria um org-link específico para arquivos PDF, facilitando a movimentação para um local exato de um PDF.

#+begin_src emacs-lisp
  
  (use-package org-pdftools
    :hook (org-mode . org-pdftools-setup-link)
    :custom
    ;; (org-pdftools-use-isearch-link t)
    (org-pdftools-use-freepointer-annot t))
  
#+end_src

*** org-noter-pdftools
O pacote /[[https://github.com/fuxialexander/org-pdftools][org-noter-pdftools]]/ integra o org-noter com org-pdftools, substituindo o org-link criado pelo org-noter com aquele criado pelo org-pdftools, possibilitando que uma anotação seja vinculada a um local espcífico do PDF.

#+begin_src emacs-lisp
  
  (use-package org-noter-pdftools
    :after org-noter
    :custom
    (org-noter-pdftools-markup-pointer-color "yellow")
    (org-noter-pdftools-free-pointer-icon "Note")
    (org-noter-pdftools-free-pointer-color "yellow")
    :config
    ;; Configuração "extra" sugerida pelo próprio mantenedor do pacote
    ;; Add a function to ensure precise note is inserted
    (defun org-noter-pdftools-insert-precise-note (&optional toggle-no-questions)
      (interactive "P")
      (org-noter--with-valid-session
       (let ((org-noter-insert-note-no-questions (if toggle-no-questions
                                                     (not org-noter-insert-note-no-questions)
                                                   org-noter-insert-note-no-questions))
             (org-pdftools-use-isearch-link t)
             (org-pdftools-use-freestyle-annot t))
         (org-noter-insert-note (org-noter--get-precise-info)))))
  
    ;; fix https://github.com/weirdNox/org-noter/pull/93/commits/f8349ae7575e599f375de1be6be2d0d5de4e6cbf
    (defun org-noter-set-start-location (&optional arg)
      "When opening a session with this document, go to the current location.
  With a prefix ARG, remove start location."
      (interactive "P")
      (org-noter--with-valid-session
       (let ((inhibit-read-only t)
             (ast (org-noter--parse-root))
             (location (org-noter--doc-approx-location (when (called-interactively-p 'any) 'interactive))))
         (with-current-buffer (org-noter--session-notes-buffer session)
           (org-with-wide-buffer
            (goto-char (org-element-property :begin ast))
            (if arg
                (org-entry-delete nil org-noter-property-note-location)
              (org-entry-put nil org-noter-property-note-location
                             (org-noter--pretty-print-location location))))))))
    (with-eval-after-load 'pdf-annot
      (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
  
#+end_src

*** ivy-bibtex
O pacote /[[https://github.com/tmalsburg/helm-bibtex][ivy-bibtex]]/ permite procurar e gerenciar bibliografia BibTeX.

#+begin_src emacs-lisp
  
  (use-package ivy-bibtex
    :custom
    (bibtex-completion-bibliography (list (concat jlf/slipbox-refs-directory "bibliography.bib")))
    (bibtex-completion-library-path (list jlf/slipbox-refs-directory))
    (bibtex-completion-find-note-functions '(orb-find-note-file)))
  
#+end_src

*** org-ref
O pacote /[[https://github.com/jkitchin/org-ref][org-ref]]/ cria a utilidade de citação ao estilo BibTeX para org-mode.

#+begin_src emacs-lisp
  
  (use-package org-ref
    :after ivy-bibtex
    :init
    (setq org-ref-completion-library 'org-ref-ivy-cite)
    :custom
    (org-ref-default-bibliography (list (concat jlf/slipbox-refs-directory "bibliography.bib")))
    (org-ref-pdf-directory jlf/slipbox-refs-directory)
    (org-ref-note-title-format "* TODO %y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :ROAM_KEY: cite:%k\n  :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n")
    (org-ref-notes-directory jlf/slipbox-refs-directory)
    (org-ref-notes-function 'orb-edit-notes)
    :config
    ;; Adicionei essas funções pra deixar o org-ref na cara do ivy-bibtex
    (bibtex-completion-init) ;; primeiro precisa inicializar o ivy-bibtex
    ;; Em seguida faz esse comando pra deixar o org-ref com a cara do ivy-bibtex
    (ivy-configure 'org-ref-ivy-insert-cite-link
      :display-transformer-fn 'ivy-bibtex-display-transformer))
  
#+end_src

*** org-roam-bibtex
O pacote /[[https://github.com/org-roam/org-roam-bibtex][org-roam-bibtex]]/ integra os pacotes org-roam, ivy-bibtex e org-ref, permitindo a utilização das funcionalidades do org-roam para referências bibliográficas.

#+begin_src emacs-lisp
  
  (use-package org-roam-bibtex
    :after org-roam
    :load-path "~/Sync/Jota/Academico/Projetos/Emacs/org-roam-bibtex-branch-v2/org-roam-bibtex/"
    :custom
    (orb-preformat-keywords
     '("=key=" "file" "title" "=type=" "author-or-editor" "year" "journal" "doi" "url" "keywords" "abstract"))
    :config
    (add-to-list 'org-roam-capture-templates
                 '("b" "Bibliography Reference"))
    (add-to-list 'org-roam-capture-templates
                 '("ba" "Article" plain
                   "%?"
                   :if-new (file+head "Refs/${=key=}.org"
                                      "#+TITLE: ${title}\n#+CITE_KEY: ${=key=}\n#+CREATED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+LAST_MODIFIED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+FILETAGS:\n\n* Info\n:PROPERTIES:\n:DOCUMENT_PATH: %(file-relative-name (orb-process-file-field \"${=key=}\") (print jlf/slipbox-refs-directory))\n:TYPE: %(capitalize \"${=type=}\")\n:AUTHOR: ${author-or-editor}\n:YEAR: ${year}\n:JOURNAL: ${journal}\n:DOI: %(if (string-equal \"${doi}\" \"\") \"---\" \"${doi}\")\n:URL: %(if (string-equal \"${url}\" \"\") \"---\" \"${url}\")\n:KEYWORDS: %(if (string-equal \"${keywords}\" \"\") \"---\" \"${keywords}\")\n%(if (string-equal \"${abstract}\" \"\") \":ABSTRACT: ---\\n\"):END:\n%(unless (string-equal \"${abstract}\" \"\") \":ABSTRACT:\\n${abstract}\\n:END:\\n\")\n* Notes\n:PROPERTIES:\n:NOTER_DOCUMENT: %(file-relative-name (orb-process-file-field \"${=key=}\") (print jlf/slipbox-refs-directory))\n:END:\n")
                   :unnarrowed t))
    (add-to-list 'org-roam-capture-templates
                 '("bb" "Book" plain
                   "%?"
                   :if-new (file+head "Refs/${=key=}.org"
                                      "#+TITLE: ${title}\n#+CITE_KEY: ${=key=}\n#+CREATED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+LAST_MODIFIED: [%<%d-%m-%Y %a %H:%M:%S>]\n#+FILETAGS:\n\n* Info\n:PROPERTIES:\n:DOCUMENT_PATH: %(file-relative-name (orb-process-file-field \"${=key=}\") (print jlf/slipbox-refs-directory))\n:TYPE: %(capitalize \"${=type=}\")\n:AUTHOR: ${author-or-editor}\n:YEAR: ${year}\n:END:\n\n* Notes\n:PROPERTIES:\n:NOTER_DOCUMENT: %(file-relative-name (orb-process-file-field \"${=key=}\") (print jlf/slipbox-refs-directory))\n:END:\n")
                   :unnarrowed t)))
  
  
  (org-roam-bibtex-mode)
  
#+end_src

*** keymap
Criação de um "keymap" próprio para facilitar a utilização de funções relativas a utilização do zettelkasten no Emacs.

#+begin_src emacs-lisp
  
  (defcustom org-research-keymap-prefix "C-c r"
    "The prefix for org-research key bindings."
    :type 'string
    :group 'org-research)
  
  (defun org-research--key (key)
    (kbd (concat org-research-keymap-prefix " " key)))
  
  (global-set-key (org-research--key "b") 'ivy-bibtex)
  (global-set-key (org-research--key "t") 'org-noter)
  (global-set-key (org-research--key "l") 'org-roam-node-insert)
  (global-set-key (org-research--key "n") 'org-noter-insert-note)
  (global-set-key (org-research--key "c") 'org-ref-insert-link)
  (global-set-key (org-research--key "r") 'org-roam-buffer-display-dedicated)
  (global-set-key (org-research--key "R") 'org-roam-buffer-toggle)
  (global-set-key (org-research--key "f") 'org-roam-node-find)
  (global-set-key (org-research--key "g") 'org-roam-graph)
  (global-set-key (org-research--key "d") 'org-roam-dailies-capture-today)
  (global-set-key (org-research--key "a a") 'org-roam-alias-add)
  (global-set-key (org-research--key "a r") 'org-roam-ref-add)
  (global-set-key (org-research--key "a t") 'org-roam-tag-add)
  (global-set-key (org-research--key "a e") 'jlf/org-roam-node-exclude-add)
  
#+end_src

** Perspective
O pacote /[[https://github.com/nex3/perspective-el][perspective]]/ permite a criação de perspectivas, isto é, grupos de buffers para projetos específicos, facilitando a movimentação entre buffers de um mesmo projeto.

#+begin_src emacs-lisp
  
  (use-package perspective
    :custom
    (persp-mode-prefix-key (kbd "C-c p"))
    (persp-state-default-file "~/.emacs.d/persp-state-session")
    (persp-modestring-short t)
    :bind (("C-x b" . persp-counsel-switch-buffer))
    :config
    (persp-mode))
  
  (add-hook 'kill-emacs-hook #'persp-state-save)
  
#+end_src

* Org Mode
 /[[https://orgmode.org/][Org Mode]]/ é um editor de documentos, planejador de projetos e tarefas e ambiente de programação muito útil e customizável, sendo de extrema importância para as tarefas e projetos do dia-a-dia.

