Emacs.org
** Protocol
O pacote /[[https://orgmode.org/worg/org-contrib/org-protocol.html][org-protocol]]/ permite a comunicação entre o Emacs org e um navegador, possibilitando salvar dados de páginas virtuais em aquivos org.

#+begin_src emacs-lisp
  
  (use-package org-protocol
    :ensure nil
    :init
    (server-start)
    :config
    (add-to-list 'org-capture-templates
                 '("p" "Protocol"))
    (add-to-list 'org-capture-templates
                 '("pb" "Bookmark" plain
                   (file+function "~/Sync/Jota/Academico/Projetos/Org/Protocol/bookmarks.org" jlf/org-protocol--capture-template-headline-target)
                   "** %(if (string-empty-p \"\%:description\") \"\%^{Title: }\" \"\%:description\")\n:LINK: %:link\n:ACCESS: [%<%d-%m-%Y %a %H:%M:%S>]\n%^{Description: }"
                   :empty-lines 1
                   :immediate-finish t) t)
    (add-to-list 'org-capture-templates
                 '("pr" "Read List" plain
                   (file+function "~/Sync/Jota/Academico/Projetos/Org/Protocol/read_list.org" jlf/org-protocol--capture-template-headline-target)
                   "** TODO %(if (string-empty-p \"\%:description\") \"\%^{Title: }\" \"\%:description\")\n:LINK: %:link\n:ACCESS: [%<%d-%m-%Y %a %H:%M:%S>]\n%^{Description: }"
                   :empty-lines 1
                   :immediate-finish t) t))
  
  ;; Função que retorna uma lista com todos os headings level N de um org-buffer
  (defun jlf/org--return-level-n-headings (N)
    (org-element-map (org-element-parse-buffer) 'headline
      (lambda (item)
        (when (= (org-element-property :level item) N) (org-element-property :raw-value item)))))
  
  ;; Função que retorna o buffer-point para inserção de um novo heading
  (defun jlf/org-protocol--capture-template-headline-target ()
    (let* ((options (jlf/org--return-level-n-headings 1))
           (heading (completing-read "Section: " (add-to-list 'options "* ADD NEW SECTION *"))))
      (if (string-equal heading "* ADD NEW SECTION *")
          (call-interactively
           (lambda (new-section)
             (interactive "sNew Section: ")
             (goto-char (point-min))
             (if (re-search-forward "^* Others" nil t)
                 (progn
                   (beginning-of-line)
                   (newline)
                   (previous-line))
               (progn
                 (goto-char (point-max))
                 (evil-open-below 2)
                 (evil-normal-state)))
             (insert (concat "* " new-section "\n"))))
        (progn
          (goto-char (point-min))
          (re-search-forward (concat "^* " heading))
          (org-end-of-subtree)
          (org-return)))))
  
#+end_src

** Evil-Org
O pacote /[[https://github.com/Somelauw/evil-org-mode][evil-org]]/ habilita keybindings do /[[https://github.com/emacs-evil/evil][evil]]/ para o /[[https://orgmode.org/][Org Mode]]/.

#+begin_src emacs-lisp

;; Melhora a integração do evil com org
(use-package evil-org
  :after org
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

#+end_src

** Headings
O pacote /[[https://github.com/sabof/org-bullets][org-bullets]]/ permite substituir os indicadores padrão dos headings (*).  

#+begin_src emacs-lisp

;; Usa bullet points em vez de hífen
(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** Templates de Estrutura
Os templates de estrutura (structure templates) permitem criar snippets para inserção de blocos de código no documento.

#+begin_src emacs-lisp

;; Structure templates para as linguagens mais utilizadas em org-mode
(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("cc" . "src C"))
  (add-to-list 'org-structure-template-alist '("cpp" . "src C++"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

** Babel
Responsável por executar ou exportar blocos de código em org-mode. Configurado de forma que o arquivo de saída associado aos blocos de código seja exportado toda vez que um arquivo do diretório do Emacs ("~/.emacs.d/") for salvo. $AJEITAR FUNÇÃO$

#+begin_src emacs-lisp

;; Configura as linguagens de programação a serem compatíveis com org-babel
(with-eval-after-load 'org
(org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
    (C . t)
    (latex . t)
    (python . t))))

;; Exporta automaticamente o arquivo de saída associado aos blocos de código (tangle) toda vez que o arquivo .org for salvo
(defun jlf/org-babel-tangle-config ()
(when (string-equal (buffer-file-name) "/Users/Jota/.emacs.d/Emacs.org")
;; (when (string-equal (file-name-directory (buffer-file-name))
;;                     (expand-file-name user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jlf/org-babel-tangle-config)))

#+end_src

* Finanças
** Ledger Mode

#+begin_src emacs-lisp
  
  ;; brew install ledger
  (use-package ledger-mode
    :init
    (setq ledger-clear-whole-transactions 1)
    :mode "\\.dat\\'")
  
#+end_src

