init.el

(use-package org-protocol
  :ensure nil
  :init
  (server-start)
  :config
  (add-to-list 'org-capture-templates
               '("p" "Protocol"))
  (add-to-list 'org-capture-templates
               '("pb" "Bookmark" plain
                 (file+function "~/Sync/Jota/Academico/Projetos/Org/Protocol/bookmarks.org" jlf/org-protocol--capture-template-headline-target)
                 "** %(if (string-empty-p \"\%:description\") \"\%^{Title: }\" \"\%:description\")\n:LINK: %:link\n:ACCESS: [%<%d-%m-%Y %a %H:%M:%S>]\n%^{Description: }"
                 :empty-lines 1
                 :immediate-finish t) t)
  (add-to-list 'org-capture-templates
               '("pr" "Read List" entry
                 (file "~/Sync/Jota/Academico/Projetos/Org/Protocol/read_list.org")
                 "* TODO %(if (string-empty-p \"\%:description\") \"\%^{Title: }\" \"\%:description\")\n:LINK: %:link\n:ACCESS: [%<%d-%m-%Y %a %H:%M:%S>]\n%^{Description: }"
                 :empty-lines 1
                 :immediate-finish t) t))

;; Função que retorna uma lista com todos os headings level 1 de um org-buffer
(defun jlf/org--return-level-1-headings ()
  (org-element-map (org-element-parse-buffer) 'headline
    (lambda (item)
      (when (= (org-element-property :level item) 1) (org-element-property :raw-value item)))))

;; Função que retorna o buffer-point para inserção de um novo favorito
(defun jlf/org-protocol--capture-template-headline-target ()
  (let* ((options (jlf/org--return-level-1-headings))
         (heading (completing-read "Bookmark Section: " (add-to-list 'options "* ADD NEW SECTION *"))))
    (if (string-equal heading "* ADD NEW SECTION *")
        (progn
          (call-interactively
           (lambda (new-bookmark-section)
             (interactive "sNew Bookmark Section: ")
             (goto-char (point-min))
             (re-search-forward "^* Others")
             (beginning-of-line)
             (newline)
             (previous-line)
             (insert (concat "* " new-bookmark-section "\n")))))
      (progn
        (goto-char (point-min))
        (re-search-forward (concat "^* " heading))
        (org-end-of-subtree)
        (org-return)))))

;; Melhora a integração do evil com org
(use-package evil-org
  :after org
  :hook (org-mode . evil-org-mode)
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

;; Usa bullet points em vez de hífen
(use-package org-bullets
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

;; Structure templates para as linguagens mais utilizadas em org-mode
(with-eval-after-load 'org
  ;; This is needed as of Org 9.2
  (require 'org-tempo)

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("cc" . "src C"))
  (add-to-list 'org-structure-template-alist '("cpp" . "src C++"))
  (add-to-list 'org-structure-template-alist '("py" . "src python")))

;; Configura as linguagens de programação a serem compatíveis com org-babel
(with-eval-after-load 'org
(org-babel-do-load-languages
    'org-babel-load-languages
    '((emacs-lisp . t)
    (C . t)
    (latex . t)
    (python . t))))

;; Exporta automaticamente o arquivo de saída associado aos blocos de código (tangle) toda vez que o arquivo .org for salvo
(defun jlf/org-babel-tangle-config ()
(when (string-equal (buffer-file-name) "/Users/Jota/.emacs.d/Emacs.org")
;; (when (string-equal (file-name-directory (buffer-file-name))
;;                     (expand-file-name user-emacs-directory))
    (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'jlf/org-babel-tangle-config)))
